podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/SIM_MKE14D7.svd.xml
            <register>
               <name>SOPT7</name>
               <description>System Options Register 7</description>
               <addressOffset>0x18</addressOffset>
               <fields>
                  <field>
                     <name>ADC0TRGSEL</name>
                     <description>ADC0 Trigger Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>PDB external trigger</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>CMP1 out</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0010</name>
                           <description>CMP1 out</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>CMP2 out</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0100</name>
                           <description>PIT trigger 0</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0101</name>
                           <description>PIT trigger 1</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0110</name>
                           <description>PIT trigger 2</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0111</name>
                           <description>PIT trigger 3</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1000</name>
                           <description>FTM0 trigger</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1001</name>
                           <description>FTM1 trigger</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1010</name>
                           <description>FTM2 trigger</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1011</name>
                           <description>FTM3 trigger</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1100</name>
                           <description>High speed comparator 3 output</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1101</name>
                           <description>RTC interrupt</description>
                           <value>0b1101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1110</name>
                           <description>Unused</description>
                           <value>0b1110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1111</name>
                           <description>Unused</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ADC0TRGSEL" > <name>ADC1TRGSEL</name> <description>ADC1 Trigger Select</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="ADC0TRGSEL" > <name>ADC2TRGSEL</name> <description>ADC2 Trigger Select</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="ADC0TRGSEL" > <name>ADC3TRGSEL</name> <description>ADC3 Trigger Select</description> <bitOffset>12</bitOffset> </field>
                  <field>
                     <name>CMP0WS</name>
                     <description>CMP0 windows select</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>PDB0</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>PDB1</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>PDB2</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>PDB3</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CMP0WS" > <name>CMP1WS</name> <description>CMP1 windows select</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="CMP0WS" > <name>CMP2WS</name> <description>CMP2 windows select</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="CMP0WS" > <name>CMP3WS</name> <description>CMP3 windows select</description> <bitOffset>22</bitOffset> </field>
                  <field>
                     <name>ADC0ALTTRGEN</name>
                     <description>ADC0 Alternate Trigger Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>PDB Trigger Selected for ADC0</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Alternate Trigger Selected for ADC0</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADC1ALTTRGEN</name>
                     <description>ADC1 Alternate Trigger Enable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>PDB trigger</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Alternate trigger(ADC1TRGSEL)</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADC2ALTTRGEN</name>
                     <description>ADC2 Alternate Trigger Enable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>PDB Trigger Selected for ADC2</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Alternate Trigger Selected for ADC2 as defined by ADC2TRGSEL</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADC3ALTTRGEN</name>
                     <description>ADC3 Alternate Trigger Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>PDB Trigger Selected for ADC3</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Alternate Trigger Selected for ADC3 as defined by ADC3TRGSEL</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SDID</name>
               <description>System Device Identification Register</description>
               <addressOffset>0x24</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>BOID</name>
                     <description>Pincount Identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>Reserved</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>Reserved</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0010</name>
                           <description>Reserved</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>Reserved</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0100</name>
                           <description>44-pin</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0101</name>
                           <description>64-pin</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0110</name>
                           <description>80-pin</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0111</name>
                           <description>Reserved</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1000</name>
                           <description>100-pin</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIEID</name>
                     <description>Device family identification</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>REVID</name>
                     <description>Device Revision Number</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCGC5</name>
               <description>System Clock Gating Control Register 5</description>
               <addressOffset>0x38</addressOffset>
               <resetValue>0xD00030</resetValue>
               <fields>
                  <field>
                     <name>EWM</name>
                     <description>EWM Clock Gate Control</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Clock disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Clock enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="EWM" > <name>CMT</name> <description>CMT Clock Gate Control</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>IIC0</name> <description>IIC0 Clock Gate Control</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>IIC1</name> <description>IIC1 Clock Gate Control</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>UART0</name> <description>UART0 Clock Gate Control</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>UART1</name> <description>UART1 Clock Gate Control</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>UART2</name> <description>UART2 Clock Gate Control</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>UART3</name> <description>UART3 Clock Gate Control</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>SPI0</name> <description>SPI0 Clock Gate Control</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>SPI1</name> <description>SPI1 Clock Gate Control</description> <bitOffset>15</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>ACMP0</name> <description>ACMP0 Clock Gate Control</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>ACMP1</name> <description>ACMP1 Clock Gate Control</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>ACMP2</name> <description>ACMP2 Clock Gate Control</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>ACMP3</name> <description>ACMP3 Clock Gate Control</description> <bitOffset>19</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>SCGC6</name>
               <description>System Clock Gating Control Register 6</description>
               <addressOffset>0x3C</addressOffset>
               <resetValue>0x6040000</resetValue>
               <fields>
                  <field>
                     <name>DMAMUX0</name>
                     <description>DMAMUX Clock Gate Control</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Clock disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Clock enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="DMAMUX0" > <name>PIT</name> <description>PIT Clock Gate Control</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="DMAMUX0" > <name>CRC</name> <description>CRC Clock Gate Control</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="DMAMUX0" > <name>PDB0</name> <description>PDB0 Clock Gate Control</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="DMAMUX0" > <name>PDB1</name> <description>PDB1 Clock Gate Control</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="DMAMUX0" > <name>PDB2</name> <description>PDB2 Clock Gate Control</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="DMAMUX0" > <name>PDB3</name> <description>PDB3 Clock Gate Control</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="DMAMUX0" > <name>FTM0</name> <description>FTM0 Clock Gate Control</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="DMAMUX0" > <name>FTM1</name> <description>FTM1 Clock Gate Control</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="DMAMUX0" > <name>FTM2</name> <description>FTM2 Clock Gate Control</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="DMAMUX0" > <name>FTM3</name> <description>FTM3 Clock Gate Control</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="DMAMUX0" > <name>RTC</name> <description>RTC Clock Gate Control</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="DMAMUX0" > <name>TSI</name> <description>TSI Clock Gate Control</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="DMAMUX0" > <name>PORTA</name> <description>Port A Clock Gate Control</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="DMAMUX0" > <name>PORTB</name> <description>Port B Clock Gate Control</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="DMAMUX0" > <name>PORTC</name> <description>Port C Clock Gate Control</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="DMAMUX0" > <name>PORTD</name> <description>Port D Clock Gate Control</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="DMAMUX0" > <name>PORTE</name> <description>Port E Clock Gate Control</description> <bitOffset>23</bitOffset> </field>
                  <field derivedFrom="DMAMUX0" > <name>ADC0</name> <description>ADC0 Clock Gate Control</description> <bitOffset>27</bitOffset> </field>
                  <field derivedFrom="DMAMUX0" > <name>ADC1</name> <description>ADC1 Clock Gate Control</description> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="DMAMUX0" > <name>ADC2</name> <description>ADC2 Clock Gate Control</description> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="DMAMUX0" > <name>ADC3</name> <description>ADC3 Clock Gate Control</description> <bitOffset>30</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>SCGC7</name>
               <description>System Clock Gating Control Register 7</description>
               <addressOffset>0x40</addressOffset>
               <resetValue>0xF</resetValue>
               <fields>
                  <field>
                     <name>FLEXBUS</name>
                     <description>Flexbus Clock Gate Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Clock disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Clock enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="FLEXBUS" > <name>DMA</name> <description>DMA Clock Gate Control</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="FLEXBUS" > <name>MPU</name> <description>MPU Clock Gate Control</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="FLEXBUS" > <name>IEVT</name> <description>IEVT Clock Gate Control</description> <bitOffset>3</bitOffset> </field>
               </fields>
            </register>
